<!--1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.-->
<h2>Задание 1</h2>
<?php

$i = 0;
while ($i <= 100) {
    if ($i % 3 === 0) echo $i . ' ';
    $i++;
}

?>

<!--2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:-->
<!--0 – ноль.-->
<!--1 – нечетное число.-->
<!--2 – четное число.-->
<!--3 – нечетное число.-->
<!--…-->
<!--10 – четное число.-->
<h2>Задание 2</h2>
<?php

$i = 0;
do {
    if ($i === 0) echo "$i - ноль.<br/>";
    elseif ($i % 2 === 0) echo "$i - четное.<br/>";
    else echo "$i - нечетное.<br/>";
} while ($i++ <= 10);

?>


<!--3. Объявить массив, в котором в качестве ключей будут использоваться названия областей,
а в качестве значений – массивы с названиями городов из соответствующей области.
Вывести в цикле значения массива, чтобы результат был таким:-->
<!--Московская область:-->
<!--Москва, Зеленоград, Клин-->
<!--Ленинградская область:-->
<!--Санкт-Петербург, Всеволожск, Павловск, Кронштадт-->
<!--Рязанская область … (названия городов можно найти на maps.yandex.ru)-->
<h2>Задание 3</h2>
<?php

$regions = [
    'Московская область' => [
        'Москва',
        'Зеленоград',
        'Клин',
    ],
    'Ленинградская область' => [
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск',
        'Кронштадт',
    ],
    'Рязанская область' => [
        'Рязань',
        'Касимов',
        'Ряжск',
    ]
];

foreach ($regions as $region => $cities) {
    echo "$region: ";
    foreach ($cities as $city) {
        echo "$city, ";
    }
    echo '<br/>';
}

?>

<!--4. Объявить массив, индексами которого являются буквы русского языка,
а значениями – соответствующие латинские буквосочетания
(‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).-->
<!--Написать функцию транслитерации строк.-->
<h2>Задание 4</h2>
<?php

function translit($text)
{

    $litters = [
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "e",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "i",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "kh",
        "ц" => "tc",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "shch",
        "ы" => "y",
        "э" => "e",
        "ю" => "yu",
        "я" => "ya",
        "ь" => ""
    ];

    return strtr($text, $litters);

}

echo translit("задание 4 сделано!");

?>

<!--5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.-->
<h2>Задание 5</h2>
<?php

function replace($text)
{

    return str_replace(' ', '_', $text);

}

echo replace('Задание 5 сделано!');

?>

<!--6. В имеющемся шаблоне сайта заменить статичное меню (ul – li) на генерируемое через PHP.
Необходимо представить пункты меню как элементы массива и вывести их циклом.
Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.-->
<h2>Задание 6</h2>
<?php

$tree = [
    0 => [
        'name' => 'Главная',
        'link' => 'index.php',
        'childs' => [
            0 => [
                'name' => 'Подменю1',
                'link' => 'index.php',
                'childs' => [
                    0 => [
                        'name' => 'Подменю2',
                        'link' => 'index.php',
                        'childs' => []
                    ]
                ]
            ],
            1 => [
                'name' => 'Подменю1',
                'link' => 'index.php',
                'childs' => [
                    0 => [
                        'name' => 'Подменю2',
                        'link' => 'index.php',
                        'childs' => []
                    ]
                ]
            ]
        ]
    ],
    1 => [
        'name' => 'Статьи',
        'link' => 'posts.php',
        'childs' => [
            0 => [
                'name' => 'Подменю1',
                'link' => 'posts.php',
                'childs' => [
                    0 => [
                        'name' => 'Подменю2',
                        'link' => 'posts.php',
                        'childs' => []
                    ],
                    1 => [
                        'name' => 'Подменю2',
                        'link' => 'posts.php',
                        'childs' => []
                    ]
                ]
            ]
        ]
    ]
];

function getMenuHtml ($tree) {

    $str = '';

    foreach ($tree as $menu) {
        $str .= catToTemplate($menu);
    }

    return $str;

}

function catToTemplate ($menu) {

    $str = "<li class=\"menu__list\"><a class=\"menu__link\" href=\"{$menu['link']}\">{$menu['name']}</a>";

    if (isset($menu['childs'])) {
        $str .= '<ul>';
        $str .= getMenuHtml($menu['childs']);
        $str .= '</ul>';
    }

    return $str;

}

echo getMenuHtml($tree);

?>

<!--7. *Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть должно так:-->
<!--for (…){ // здесь пусто}-->
<h2>Задание 7</h2>
<?php

for ($i = 0; $i < 10; print($i++)) {}

?>

<!--8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».-->
<h2>Задание 8</h2>
<?php

$regions = [
    'Московская область' => [
        'Москва',
        'Зеленоград',
        'Клин',
    ],
    'Ленинградская область' => [
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск',
        'Кронштадт',
    ],
    'Рязанская область' => [
        'Рязань',
        'Касимов',
        'Ряжск',
    ]
];

foreach ($regions as $region => $cities) {
    echo "$region: ";
    foreach ($cities as $city) {
        if (mb_substr($city, 0, 1) === 'К') echo "$city, ";
    }
    echo '<br/>';
}

?>

<!--9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке,
производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается
при конструировании url-адресов на основе названия статьи в блогах).-->
<h2>Задание 9</h2>
<?php

function translit9($text)
{

    $litters = [
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "e",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "i",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "kh",
        "ц" => "tc",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "shch",
        "ы" => "y",
        "э" => "e",
        "ю" => "yu",
        "я" => "ya",
        "ь" => "",
        " " => "_"
    ];

    return strtr($text, $litters);

}

echo translit9("задание 9 сделано!");
